Repository: minimalistHiro/HiraganaKatakanaPractice
Catalog: HiraganaPractice/*.lproj/Localizable.strings
Languages: fr, ku

source: Background Music
fr: Musique de fond

source: Delete data
fr: Suprimmer les données
ku: Daneyên jêbirin

source: Delete all?
fr: Tout supprimer ?
ku: Hemî jêbirin?

source: Delete
fr: Supprimer
ku: Jêbirin

source: Cancel
fr: Annuler
ku: Bişûndekirin

source: It has been deleted.
fr: Il a été supprimé.
ku: hatiye jêbirin.

source: OK
fr: D'ACCORD

source: I'm finally halfway through. Practice the remaining yellow letters!
fr: Je suis enfin à mi-chemin. Pratiquez les lettres jaunes restantes !
ku: Di dawiyê de ez di nîvê rê de me. Tîpên zer ên mayî pratîk bikin!

source: Congratulation! You've cleared everything. Go to the next level when you are ready.
fr: félicitation ! Vous avez tout effacé. Passez au niveau suivant lorsque vous êtes prêt.
ku: Pîrozbahî! Te her tişt paqij kir. Gava ku hûn amade ne, biçin asta duyemîn.

source: Wonderful! Perfect! This level is perfect.
fr: Merveilleux! Parfait! Ce niveau est parfait.
ku: Pirxweş! Lhevderketî! Ev asta bêkêmasî ye.

source: You did it! You were able to write it with a hidden example. If you hide the example and write it, you will receive an accent.
fr: Tu l'as fait! Vous avez pu l'écrire avec un exemple caché. Si vous cachez l'exemple et l'écrivez, vous recevrez un accent.
ku: Te ew kir! We karîbû wê bi mînakek veşartî binivîsanda. Heke hûn nimûneyê veşêrin û binivîsin, hûn ê aksanek bistînin.

source: Once you get used to it, press the text button on the bottom left and try writing with the model hidden!
fr: Une fois que vous vous y êtes habitué, appuyez sur le bouton texte en bas à gauche et essayez d'écrire avec le modèle caché !
ku: Gava ku hûn jê re fêr bibin, bişkoja nivîsê ya li binê çepê bikirtînin û bi modela veşartî binivîsin!
